#include<stdio.h>


//int main()
//{
//	//符号两端是整数就只是整数的运算，只有等号两端有一个是浮点数
//	//才执行浮点数的除法，才能有小数
//	float c = 5 /2.0;
//	int b = 9 % 5;
//	//取模操作符的两端只能是整数
//	printf("%f\n", c);
//	printf("%d\n", b);
//
//
//
//	return 0;
//}


//int main()
//{
//	int a = 0;
//	a = 20;
//	a = a + 3;
//	a += 3;// a = a + 3
//	a - +3;// a = a - 3
//	 //同理 *=  /= 等等
//
//
//	return 0;
//}


//int main()
//{
//	//  a + b;
//	//其中  + 就是双目操作符，两边有两个符号
//	int temp = 0;
//	if (!temp)//取返，取的是真假的反，要是真就取成假（0）
//	{
//		printf("aaaaa/n");
//	}
//
//
//	return 0;
//}

//int main()
//{
//	int a = 3.14;
//	int a = (int)3.14;//强转，只有整数位
//
//	// 3.14 字面浮点数，编译器默认理解为double型
//
//
//
//	return 0;
//}


//int main()
//{
//
//	// && 逻辑与 -并且  
//	// ||逻辑或  -或者   有一个为真就行
//	int  a = 10;
//	int  b = 20;
//	if (a && b)  // a,b都是真才是真
//	{
//		printf("sdasdad\n");
//	}
//
//
//	return 0;
//}


//三目操作符
//exp1 ? exp2 : exp3
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int r = a > b ? a : b; // 判断式为真取左边，为假取右边
//	 
//	printf("%d\n", r);
//	return 0;
//}

// 逗号表达式 就是逗号隔开的一串表达式
//逗号表达式特点是：从左向右依次计算，整个表达式的结果是最后一个表示的结果
//int main()
//{
//
//	int a = 10;
//	int b = 20;
//	int c = 0;
//	//        c=8        a=28        5  
//	int d = (c = a - 2, a = b + c, c - 3);  //在执行第一个的时候c的值就已经变了，就已经会影响后续的计算了
//	printf("%d\n", d);  // d = 5
//
//
//	return 0;
//}

//int main()
//{
//
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,0 };
//	arr[3] = 20;// []就是下标应用操作符  arr和3就是【】的操作数
//	int n = 3;
//	arr[n] = 20;//这个只有在定义一个数组的时候才是用一个常量
//	// 这个只是调用里面的一个数，所以可以用变量
//
//
//	return 0;
//}






// 函数调用操作符 （）

int Add(int x, int y)
{
	return x + y;
}

int main()
{
	int sum = Add(3, 5);//这里的这个括号就是函数调用  
	//  Add ,3 ,5都是 （）的操作数

	return 0;
}